In [4]:
import numpy as np

In [5]:
import pandas as pd

In [6]:
from numpy.random import randn

In [7]:
np.random.seed(101)

In [8]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],[1,2,3,4])

In [9]:
df

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
# CONDITIONAL SELECTION

In [11]:
booldf=df>0

In [12]:
booldf

       1      2      3      4
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [13]:
df[booldf]
# only the data corresponding to True is printed

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df[1]>0

A     True
B     True
C    False
D     True
E     True
Name: 1, dtype: bool

In [15]:
df[df[1]>0][[1,3]]

          1         3
A  2.706850  0.907969
B  0.651118 -0.848077
D  0.188695 -0.933237
E  0.190794  2.605967

In [16]:
df1=df[df[1]>0]
# here a DataFrame is being returned based of one condition i.e. the entries in coloumn '1' must be greater than 0

In [17]:
df1

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df1[[1,3]]

          1         3
A  2.706850  0.907969
B  0.651118 -0.848077
D  0.188695 -0.933237
E  0.190794  2.605967

In [19]:
df[4]<0

A    False
B    False
C     True
D    False
E    False
Name: 4, dtype: bool

In [20]:
df[df[4]<0]
# here a DataFrame is being returned based of one condition

          1         2         3         4
C -2.018168  0.740122  0.528813 -0.589001

In [21]:
True and False
# the and operator is only capable of comparing single true and false

False

In [22]:
df[(df[1]>0) & (df[3]<0)]
# in order to access a dataframe with two conditions
# we need to use '&'in place of 'and' that is capable of comparing multiple rows of boolean values
# '|' operator is used in palce of 'or'

          1         2         3         4
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [23]:
df.reset_index()
# for permanent effect pass inplace=True

  index         1         2         3         4
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [24]:
df

          1         2         3         4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df[5]=['alu','ka','ap','cu','ra']

In [26]:
df

          1         2         3         4    5
A  2.706850  0.628133  0.907969  0.503826  alu
B  0.651118 -0.319318 -0.848077  0.605965   ka
C -2.018168  0.740122  0.528813 -0.589001   ap
D  0.188695 -0.758872 -0.933237  0.955057   cu
E  0.190794  1.978757  2.605967  0.683509   ra

In [27]:
df.set_index(5)

            1         2         3         4
5
alu  2.706850  0.628133  0.907969  0.503826
ka   0.651118 -0.319318 -0.848077  0.605965
ap  -2.018168  0.740122  0.528813 -0.589001
cu   0.188695 -0.758872 -0.933237  0.955057
ra   0.190794  1.978757  2.605967  0.683509